# GetCurrentBrowserOrganizationForSheets Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization..::..GetCurrentBrowserOrganizationForSheets Method
BrowserOrganization Class See Also
---
Gets the BrowserOrganization that applies to the Sheets section of the project browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static BrowserOrganization GetCurrentBrowserOrganizationForSheets(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetCurrentBrowserOrganizationForSheets ( _
	document As Document _
) As BrowserOrganization
```

Visual C++
---
```text
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForSheets(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Revit document from which to get the organization data.
# ### Return Value
The BrowserOrganization for sheets, or null if no sheets exist.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace